MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/core/tmpm370/src/tmpm370_pmd.c
    /* Get the value of PMDxMDPOT <POLH> and PMDxMDPOT <POLL> */
    fPOLHL = (uint8_t) (PMDx->MDPOT >> 2U);
    fPOLHL &= 0x03U;

    value_PWM = (uint32_t) Output / 4U;
    reg = PMDx->MDOUT & t_MDOUTMask[PMDPhase];

    if ((fPOLHL == 3U) || (fPOLHL == 0U)) {
        fPOLHL >>= 1U;
        value_OC = (uint32_t) t_PMDPortOutput[fPOLHL][Output];
        value_PWM <<= 8U;
        if (PMDPhase == PMD_PHASE_ALL) {
            reg = value_OC | (value_OC << 2U) | (value_OC << 4U) |
                value_PWM | (value_PWM << 1U) | (value_PWM << 2U);
        } else {
            value_PWM <<= PMDPhase;
            PMDPhase <<= 1U;
            reg |= (value_PWM | (value_OC << PMDPhase));
        }
        PMDx->MDOUT = reg;
        retval = SUCCESS;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Set the ADC trigger compare registers' value of the specified PMD channel. 
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  TRGCMP0Timing: Value of ADC trigger compare register 0, from 0x0001 to [MDPRD set value 每 1].
  * @param  TRGCMP1Timing: Value of ADC trigger compare register 1, from 0x0001 to [MDPRD set value 每 1].
  * @param  TRGCMP2Timing: Value of ADC trigger compare register 2, from 0x0001 to [MDPRD set value 每 1].
  * @param  TRGCMP3Timing: Value of ADC trigger compare register 3, from 0x0001 to [MDPRD set value 每 1].
  * @retval None.
  * @note PMDxTRGCMPn should be set in a range of 1 to [MDPRD set value 每 1].
  */
void PMD_SetTrgCmpValue(TSB_PMD_TypeDef * PMDx, uint32_t TRGCMP0Timing, uint32_t TRGCMP1Timing,
                        uint32_t TRGCMP2Timing, uint32_t TRGCMP3Timing)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_VALUE(TRGCMP0Timing));
    assert_param(IS_PMD_VALUE(TRGCMP1Timing));
    assert_param(IS_PMD_VALUE(TRGCMP2Timing));
    assert_param(IS_PMD_VALUE(TRGCMP3Timing));

    /* Set PMDxTRGCMP0 <TRGCMP0> */
    PMDx->TRGCMP0 = TRGCMP0Timing;
    /* Set PMDxTRGCMP1 <TRGCMP1> */
    PMDx->TRGCMP1 = TRGCMP1Timing;
    /* Set PMDxTRGCMP2 <TRGCMP2> */
    PMDx->TRGCMP2 = TRGCMP2Timing;
    /* Set PMDxTRGCMP3 <TRGCMP3> */
    PMDx->TRGCMP3 = TRGCMP3Timing;
}

/**
  * @brief  Set trigger mode of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  PMDTrg: Select the PMD Trigger.
  *   This parameter can be one of the following values:
  *   PMD_ADC_TRG_0, PMD_ADC_TRG_1, PMD_ADC_TRG_2, PMD_ADC_TRG_3.
  * @param  Mode: PMD trigger mode.
  *   This parameter can be one of the following values:
  *   PMD_TRG_MODE_0, PMD_TRG_MODE_1, PMD_TRG_MODE_2, PMD_TRG_MODE_3,
  *   PMD_TRG_MODE_4, PMD_TRG_MODE_5, PMD_TRG_MODE_6, PMD_TRG_MODE_7.
  * @retval None.
  */
void PMD_SetTrgMode(TSB_PMD_TypeDef * PMDx, uint32_t PMDTrg, uint32_t Mode)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_ADC_TRG(PMDTrg));
    assert_param(IS_PMD_TRG_MODE(Mode));

    /* Judge the trigger */
    switch (PMDTrg) {
    case PMD_ADC_TRG_0:
        /* Set PMDxTRGCR <TRG0MD> to select trigger 0 mode */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG0MD_MASK;
        tmp |= (Mode << 0U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_1:
        /* Set PMDxTRGCR <TRG1MD> to select trigger 1 mode */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG1MD_MASK;
        tmp |= (Mode << 4U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_2:
        /* Set PMDxTRGCR <TRG2MD> to select trigger 2 mode */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG2MD_MASK;
        tmp |= (Mode << 8U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_3:
        /* Set PMDxTRGCR <TRG3MD> to select trigger 3 mode */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG3MD_MASK;
        tmp |= (Mode << 12U);
        PMDx->TRGCR = tmp;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Set trigger buffer update timing of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  PMDTrg: Select the PMD Trigger.
  *   This parameter can be one of the following values:
  *   PMD_ADC_TRG_0, PMD_ADC_TRG_1, PMD_ADC_TRG_2, PMD_ADC_TRG_3.
  * @param  UpdateTiming: PMDTRG0 to PMDTRG1 buffer update timing.
  *   This parameter can be one of the following values:
  *   PMD_TRG_UPDATE_SYNC, PMD_TRG_UPDATE_ASYNC.
  * @retval None.
  */
void PMD_SetTrgUpdate(TSB_PMD_TypeDef * PMDx, uint32_t PMDTrg, uint32_t UpdateTiming)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_ADC_TRG(PMDTrg));
    assert_param(IS_PMD_TRG_TIMING(UpdateTiming));

    /* Judge the trigger */
    switch (PMDTrg) {
    case PMD_ADC_TRG_0:
        /* Set PMDxTRGCR <TRG0BE> to select trigger 0 buffer update timing */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG0BE_MASK;
        tmp |= (UpdateTiming << 3U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_1:
        /* Set PMDxTRGCR <TRG1BE> to select trigger 1 buffer update timing */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG1BE_MASK;
        tmp |= (UpdateTiming << 7U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_2:
        /* Set PMDxTRGCR <TRG2BE> to select trigger 2 buffer update timing */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG2BE_MASK;
        tmp |= (UpdateTiming << 11U);
        PMDx->TRGCR = tmp;
        break;
    case PMD_ADC_TRG_3:
        /* Set PMDxTRGCR <TRG3BE> to select trigger 3 buffer update timing */
        tmp = PMDx->TRGCR & PMD_TRGCR_TRG3BE_MASK;
        tmp |= (UpdateTiming << 15U);
        PMDx->TRGCR = tmp;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Enable or disable trigger output in EMG protection state of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  NewState: Output enable in EMG protection state.
  *   This parameter can be one of the following values:
  *   ENABLE, DIABLE.
  * @retval None.
  */
void PMD_SetEMGTrg(TSB_PMD_TypeDef * PMDx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        PMDx->TRGMD |= PMD_TRGMD_EMGTGE_SET;
    } else {
        PMDx->TRGMD &= PMD_TRGMD_EMGTGE_CLEAR;
    }
}

/**
  * @brief  Set trigger output of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  TrgMode: Select the trigger output mode.
  *   This parameter can be one of the following values:
  *   PMD_TRG_FIXED_OUTPUT, PMD_TRG_VARIABLE_OUTPUT.
  * @param  TrgChannel: Trigger output select.
  *   This parameter can be one of the following values:
  *   when TrgMode == PMD_TRG_FIXED_OUTPUT:
  *   PMD_TRG_OUTPUT_0, PMD_TRG_OUTPUT_1, PMD_TRG_OUTPUT_2, PMD_TRG_OUTPUT_3.
  *   when TrgMode == PMD_TRG_VARIABLE_OUTPUT:
  *   PMD_TRG_OUTPUT_0, PMD_TRG_OUTPUT_1, PMD_TRG_OUTPUT_2, 
  *   PMD_TRG_OUTPUT_3, PMD_TRG_OUTPUT_4, PMD_TRG_OUTPUT_5.
  * @retval None.
  */
void PMD_SetTrgOutput(TSB_PMD_TypeDef * PMDx, uint32_t TrgMode, uint32_t TrgChannel)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_TRG_OUTPUT_MODE(TrgMode));
    /* Judge the trigger output mode */
    if (TrgMode == PMD_TRG_FIXED_OUTPUT) {
        /* Check the parameters */
        assert_param(IS_PMD_TRG_FIXED_OUTPUT(TrgChannel));
    } else {
        /* Check the parameter */
        assert_param(IS_PMD_TRG_OUTPUT(TrgChannel));
    }

