MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/core/tmpm370/src/tmpm370_pmd.c
    /* Set PMDxTRGMD <TRGOUT> to select trigger output mode */
    tmp = PMDx->TRGMD & PMD_TRGMD_TRGOUT_MASK;
    tmp |= (TrgMode << 1U);
    PMDx->TRGMD = tmp;

    /* Judge the trigger output mode */
    if (TrgMode == PMD_TRG_VARIABLE_OUTPUT) {
        /* Set PMDxTRGSEL <TRGSEL> to select trigger output channel */
        tmp = PMDx->TRGSEL & PMD_TRGSEL_TRGSEL_MASK;
        tmp |= TrgChannel;
        PMDx->TRGSEL = tmp;
    } else {
        /* Do nothing */
    }
}

/**
  * @brief  Set the select mode of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  Mode: The select mode of PMD.
  *   This parameter can be one of the following values:
  *   PMD_BUS_MODE, PMD_VE_MODE.
  * @retval None.
  */
void PMD_SetSelectMode(TSB_PMD_TypeDef * PMDx, uint32_t Mode)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_SELECT_MODE(Mode));
    /* Set PMDxMODESEL <MDSEL> to select mode for loading the second buffer value of each double-buffered register */
    PMDx->MODESEL = Mode;
}

/**
  * @brief  Set EMG input source of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  Source: EMG input source.
  *   This parameter can be one of the following values:
  *   PMD_EMG_PORT_INPUT, PMD_EMG_COMPARATOR_OUTPUT.
  * @retval None.
  */
void PMD_SetEMGInputSrc(TSB_PMD_TypeDef * PMDx, uint32_t Source)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_EMG_INPUT_SOURCE(Source));
    /* Set PMDxEMGCR <EMGISEL> to select EMG input source */
    tmp = PMDx->EMGCR & PMD_EMGCR_EMGISEL_MASK;
    tmp |= (Source << 2U);
    PMDx->EMGCR = tmp;
}

/**
  * @brief  Enable OVV protection of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @retval None.
  */
void PMD_EnableOVV(TSB_PMD_TypeDef * PMDx)
{
    /* Check the parameter */
    assert_param(IS_PMD_PERIPH(PMDx));
    /* Set PMDxOVVCR <OVVEN> to enable OVV protection */
    PMDx->OVVCR |= PMD_OVVCR_OVVEN_SET;
}

/**
  * @brief  Disable OVV protection of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @retval None.
  */
void PMD_DisableOVV(TSB_PMD_TypeDef * PMDx)
{
    /* Check the parameter */
    assert_param(IS_PMD_PERIPH(PMDx));
    /* To prohibit OVV function, three instructions must be executed consecutively */
    /* Step1: Set "0x5A" to PMDxEMGREL <EMGREL> */
    PMDx->EMGREL = PMD_EMGREL_DISABLE_COMMAND_1;
    /* Step2: Set "0xA5" to PMDxEMGREL <EMGREL> */
    PMDx->EMGREL = PMD_EMGREL_DISABLE_COMMAND_2;
    /* Step3: Set "0" to PMDxOVVCR <OVVEN> */
    PMDx->OVVCR &= PMD_OVVCR_OVVEN_CLEAR;
}

/**
  * @brief  Set the noise elimination time for abnormal condition detection input of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  NoiseElimination: Select the noise elimination time.
  *   This parameter can be one of the following values:
  *   PMD_NOISE_ELIMINATION_16, PMD_NOISE_ELIMINATION_32,
  *   PMD_NOISE_ELIMINATION_48, PMD_NOISE_ELIMINATION_64, PMD_NOISE_ELIMINATION_80,
  *   PMD_NOISE_ELIMINATION_96, PMD_NOISE_ELIMINATION_112, PMD_NOISE_ELIMINATION_128,
  *   PMD_NOISE_ELIMINATION_144, PMD_NOISE_ELIMINATION_160, PMD_NOISE_ELIMINATION_176,
  *   PMD_NOISE_ELIMINATION_192, PMD_NOISE_ELIMINATION_208, PMD_NOISE_ELIMINATION_224,
  *   PMD_NOISE_ELIMINATION_240.
  * @retval None.
  */
void PMD_SetOVVNoiseElimination(TSB_PMD_TypeDef * PMDx, uint32_t NoiseElimination)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_OVV_NOISE_ELIMINATION(NoiseElimination));
    /* Set PMDxOVVCR <OVVCNT> to select the noise elimination time */
    tmp = PMDx->OVVCR & PMD_OVVCR_OVVCNT_MASK;
    tmp |= (NoiseElimination << 8U);
    PMDx->OVVCR = tmp;
}

/**
  * @brief  Enable or disable ADC monitor interrupt input of OVV protection of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  Monitor: Select the ADC monitor for OVV protection.
  *   This parameter can be one of the following values:
  *   PMD_ADC_MONITOR_A, PMD_ADC_MONITOR_B.
  * @param  NewState: ADC monitor interrupt input enable in OVV protection state.
  *   This parameter can be one of the following values:
  *   ENABLE, DIABLE.
  * @retval None.
  */
void PMD_SetADCMonitorInput(TSB_PMD_TypeDef * PMDx, uint32_t Monitor, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_ADC_MONITOR(Monitor));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (Monitor == PMD_ADC_MONITOR_A) {
        if (NewState == ENABLE) {
            /* Set PMDxOVVCR <ADIN0EN> to enable ADC A monitor interrupt input */
            PMDx->OVVCR |= PMD_OVVCR_ADIN0EN_SET;
        } else {
            /* Clear PMDxOVVCR <ADIN0EN> to disable ADC A monitor interrupt input */
            PMDx->OVVCR &= PMD_OVVCR_ADIN0EN_CLEAR;
        }
    } else {
        if (NewState == ENABLE) {
            /* Set PMDxOVVCR <ADIN1EN> to enable ADC B monitor interrupt input */
            PMDx->OVVCR |= PMD_OVVCR_ADIN1EN_SET;
        } else {
            /* Clear PMDxOVVCR <ADIN1EN> to disable ADC B monitor interrupt input */
            PMDx->OVVCR &= PMD_OVVCR_ADIN1EN_CLEAR;
        }
    }
}

/**
  * @brief  Set OVV protection mode of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  Mode: OVV protection mode.
  *   This parameter can be one of the following values:
  *   PMD_OVV_MODE_0, PMD_OVV_MODE_1, PMD_OVV_MODE_2, PMD_OVV_MODE_3.
  * @retval None.
  */
void PMD_SetOVVMode(TSB_PMD_TypeDef * PMDx, uint32_t Mode)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_OVV_MODE(Mode));
    /* Set PMDxOVVCR <OVVMD> to select OVV protection mode */
    tmp = PMDx->OVVCR & PMD_OVVCR_OVVMD_MASK;
    tmp |= (Mode << 3U);
    PMDx->OVVCR = tmp;
}

/**
  * @brief  Set OVV input source of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  Source: OVV input source.
  *   This parameter can be one of the following values:
  *   PMD_OVV_PORT_INPUT, PMD_OVV_ADC_MONITOR.
  * @retval None.
  */
void PMD_SetOVVInputSrc(TSB_PMD_TypeDef * PMDx, uint32_t Source)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_OVV_INPUT_SOURCE(Source));
    /* Set PMDxOVVCR <OVVISEL> to select OVV input source */
    tmp = PMDx->OVVCR & PMD_OVVCR_OVVISEL_MASK;
    tmp |= (Source << 2U);
    PMDx->OVVCR = tmp;
}

  /**
  * @brief  Enable or disable automatic release of OVV protection of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @param  NewState: Automatic release enable in OVV protection state.
  *   This parameter can be one of the following values:
  *   ENABLE, DIABLE.
  * @retval None.
  */
void PMD_SetOVVAutoRelease(TSB_PMD_TypeDef * PMDx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set PMDxOVVCR <OVVRS> to enable automatic release of OVV protection */
        PMDx->OVVCR |= PMD_OVVCR_OVVRS_SET;
    } else {
        /* Clear PMDxOVVCR <OVVRS> to disable automatic release of OVV protection */
        PMDx->OVVCR &= PMD_OVVCR_OVVRS_CLEAR;
    }
}


/**
  * @brief  Get the level of abnormal condition OVV input of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @retval The level of abnormal condition input.
  *   The value returned can be one of the following values:
  *   PMD_ABNORMAL_LEVEL_L, PMD_ABNORMAL_LEVEL_H.
  */
uint32_t PMD_GetOVVAbnormalLevel(TSB_PMD_TypeDef * PMDx)
{
    uint32_t tmp = 0U;
    /* Check the parameter */
    assert_param(IS_PMD_PERIPH(PMDx));
    /* Read PMDxOVVSTA <OVVI> to get the level of abnormal condition input */
    tmp = PMDx->OVVSTA & PMD_OVVSTA_OVVI_MASK;
    return tmp;
}

/**
  * @brief  Get the OVV protection condition of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0, PMD1.
  * @retval The OVV protection condition.
  *   The value returned can be one of the following values:
  *   PMD_OVV_NORMAL, PMD_OVV_PROTECTED.
  */
uint32_t PMD_GetOVVCondition(TSB_PMD_TypeDef * PMDx)
{
    uint32_t tmp = 0U;
    /* Check the parameter */
    assert_param(IS_PMD_PERIPH(PMDx));
    /* Read PMDxOVVSTA <OVVST> to get the OVV protection condition */
    tmp = PMDx->OVVSTA & PMD_OVVSTA_OVVST_MASK;
    return tmp;
}

/* mabrouk edit pmd adc_pmdtrg */
void ADC_PmdTrg (void)
{
  
     
