MELBAT03/mohamedelbatawi/wm_orca15_nedic_base24.09/software/source/core/tmpm370/src/tmpm370_pmd.c
   /* enable the AMP for the 3-shunt resistors "ADC input" */
  
    TSB_AMP->CTLA = 0x03;
    TSB_AMP->CTLB = 0x03;
    TSB_AMP->CTLC = 0x03;
      
  /* select registers 2,3 to carry the programs 2,3 that get triggered by PMD0TRG2,3 */
   /*ADC_SelectPMDTrgProgNum(TSB_ADA, PMD_TRG_PROG_SEL2, TRG_ENABLE(PMD_PROG2));  // PMD0TRG2  ==> ADAPSEL2 ==> Program2
   ADC_SelectPMDTrgProgNum(TSB_ADA, PMD_TRG_PROG_SEL3, TRG_ENABLE(PMD_PROG3));*/  // PMD0TRG3  ==> ADAPSEL3 ==> Program3
   TSB_ADA->PSEL2 = 0x82;
   TSB_ADA->PSEL3 = 0x83;
   
   
   
   /* select the interrupt generated to each program */
  /* PMD_TrgProgINTTypeDef myIntSelection ;
   myIntSelection.INTProg0=0;
   myIntSelection.INTProg1=0;
   myIntSelection.INTProg2=1;
   myIntSelection.INTProg3=0;
   myIntSelection.INTProg4=0;
   myIntSelection.INTProg5=0;
   ADC_SetPMDTrgProgINT(TSB_ADA,myIntSelection);*/
   TSB_ADA->PINTS0 = 0;
   TSB_ADA->PINTS1 = 0;
   TSB_ADA->PINTS2 = 1;  //PMD0TRG2  ==> ADAPSEL2 ==> Program2  ==> PMD_INTADPDA 
   TSB_ADA->PINTS3 = 0;

   
   /* ADC PMD trigger program set " set each regx(0:5) to its AINy(0:11) pin and its VE phase (u,v,w) */
   TSB_ADA->PSET2 = 0x008C8D8E;  //  PMD0TRG2  ==> ADAPSEL2 ==>       Program2  =1.=> PMD_INTADPDA       
                                                                              //=2.=> reg0,1,2 to AIN12,13,14to PHASEu,v,w
   
   TSB_ADA->PSET3 = 0x82000000;  //  PMD0TRG3  ==> ADAPSEL3 ==>       Program3     => reg3 AIN8 to Vdc
   // Program3 (AINA8)  -> Reg3, Vdc
   
   
   /* additional conf */
   TSB_ADA->MOD3 = 0x0560; //fixed value at TGE
   TSB_ADA->MOD0 = 0x02; //close software tigger and on dac control
   TSB_ADA->MOD1 = 0x80; //enable adc

}
/*mabrouk edit pmd pmd_on*/
void PMD_ON(void){
    /*********solve the correct adc conversion refrence (lower)**************/
    //TSB_PMD0->MDOUT = 0x73F;
        // Configure Phase U
    PMD_SetPortOutput(PMD0, PMD_PHASE_U, PMD_OUTPUT_PWM_IPWM);

    // Configure Phase V
    PMD_SetPortOutput(PMD0, PMD_PHASE_V, PMD_OUTPUT_PWM_IPWM);

    // Configure Phase W
    PMD_SetPortOutput(PMD0, PMD_PHASE_W, PMD_OUTPUT_PWM_IPWM);
    /*****************************************************************************/
}
/*mabrouk edit pmd pmd_off*/
void PMD_OFF(void){

    //TSB_PMD0->MDOUT = 0x000;
    PMD_SetPortOutput(PMD0, PMD_PHASE_U, PMD_OUTPUT_L_L);

    // Configure Phase V
    PMD_SetPortOutput(PMD0, PMD_PHASE_V, PMD_OUTPUT_L_L);

    // Configure Phase W
    PMD_SetPortOutput(PMD0, PMD_PHASE_W, PMD_OUTPUT_L_L);
    
    /**********************************************************************/
}

/*mabrouk edit pmd pmdenableandrelease*/
void PMD_EnableEMG_andRelease(TSB_PMD_TypeDef * PMDx)
{
    /* Check the parameter */
    assert_param(IS_PMD_PERIPH(PMDx));

    /* Set PMDxEMGCR to achieve the equivalent of 0x0F3B */
    PMDx->EMGCR = PMD_ENABLE_EMG_AND_RELEASE ;
}
/** @} */
/* End of group PMD_Exported_Functions */

/** @} */
/* End of group PMD */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM370_PMD_H) */
